[
  {
    "toyId": 1,
    "toyName": "Lego Classic Creative Brick Box",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "The Lego Classic Creative Brick Box is the ultimate building set designed to inspire endless hours of creativity and imaginative play for builders of all ages. This massive collection features over 790 pieces in 33 different colors, including a variety of bricks, windows, doors, wheels, and specialized elements to encourage open-ended construction. It serves as a perfect starter kit for young builders or an excellent supplement to existing collections. The set comes in a robust, reusable plastic storage box, making cleanup and organization simple and convenient. With this collection, children can follow simple included guides to construct complex models like houses, trains, and animals, or they can unleash their genius to invent entirely new creations. This toy is not just about fun; it actively promotes spatial reasoning, problem-solving skills, and fine motor development, making it an invaluable tool for educational development. The durability and interlocking design of Lego bricks ensure that creations remain stable and that the set will last for years, becoming a hand-me-down favorite. It's a foundational toy that truly stands the test of time, engaging both solo play and collaborative building projects with friends or family. This specific set is highly rated for its versatility and high piece-to-price value, guaranteeing a rewarding building experience for every child. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/MD0tNrNR/1.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 2,
    "toyName": "Remote Control Drone X-10 with HD",
    "sellerName": "Tech Toy Shop",
    "sellerEmail": "sales@techtoys.com",
    "price": 129.5,
    "rating": 4.5,
    "availableQuantity": 30,
    "description": "The Drone X-10 is a high-performance, easy-to-fly quadcopter designed for both beginner and intermediate pilots who want to capture stunning aerial views. Equipped with a 1080p HD camera, this drone allows for real-time video transmission directly to your smartphone via the dedicated app, providing a breathtaking first-person view (FPV) experience. It features one-key take-off and landing, altitude hold, and headless mode, making control intuitive and significantly reducing the learning curve for new users. The robust build and propeller guards ensure it can withstand minor crashes, extending its lifespan. Its powerful, rechargeable battery provides up to 15 minutes of continuous flight time, and the included remote control boasts a range of up to 100 meters, allowing for expansive exploration and photography. The Drone X-10 is perfect for capturing family events, scenic landscapes, or simply enjoying the thrill of advanced remote control technology. The sleek, foldable design makes it highly portable, fitting easily into a backpack for adventures. This model represents an excellent balance of features, durability, and affordability in the advanced toy category, promising hours of entertainment and a unique perspective on the world. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/M5P91H0g/2.jpg",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 3,
    "toyName": "Galaxy Explorer Action Figure ",
    "sellerName": "Collector's Den",
    "sellerEmail": "support@collectorsden.net",
    "price": 25.99,
    "rating": 4.8,
    "availableQuantity": 150,
    "description": "Introducing the Limited Edition Galaxy Explorer, a meticulously crafted 6-inch action figure that brings the epic space saga right into your collection. This figure features over 25 points of articulation, allowing for dynamic posing and realistic scene recreation from the movies and comics. Every detail, from the weathered space suit to the intricate helmet design, has been rendered with stunning accuracy, appealing to both serious collectors and enthusiastic fans. Included accessories are a laser blaster, a removable jetpack with articulated wings, and two interchangeable hand sculpts for diverse display options. The figure is packaged in a collector-friendly window box that highlights the character's unique lore. As a highly rated item, it is celebrated for its premium paint application and sturdy build quality. The Galaxy Explorer is designed not only for display but also for rigorous play, inspiring children to invent their own thrilling interstellar missions and stories. It's an excellent piece to start or enhance an action figure collection, offering superior quality compared to standard figures. Don't miss this opportunity to own a piece of the galaxy. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/Hf6sYWDF/3.jpg",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 4,
    "toyName": "Wooden Stacking Rings Learning Tower",
    "sellerName": "Little Learners Toys",
    "sellerEmail": "info@littlelearners.co",
    "price": 18.0,
    "rating": 4.6,
    "availableQuantity": 92,
    "description": "This classic Wooden Stacking Rings Learning Tower is an essential toy for early childhood development, specifically designed for toddlers aged 12 months and up. The set consists of a solid wooden base, a rocking pole, and five smooth, brightly colored rings of varying sizes. The primary goal is to stack the rings in the correct size order, which is a deceptively simple task that helps children master critical cognitive and physical skills. Playing with this tower significantly enhances **fine motor skills** and **hand-eye coordination** as the child attempts to grasp the rings and thread them onto the pole. Furthermore, it introduces foundational concepts of size sequencing, spatial relationships, and color identification in a tactile, engaging way. The toy is crafted from sustainable, high-quality wood and finished with non-toxic, child-safe paints, ensuring absolute safety during play. Its simple, durable design ensures it can withstand the wear and tear of toddler use, lasting through multiple developmental stages. It's a quiet, engaging toy that requires active participation from the child, providing a valuable alternative to electronic devices. This tower is highly recommended by educators for its strong developmental benefits. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/vC78JVzP/4.webp",
    "subCategory": "Educational"
  },
  {
    "toyId": 5,
    "toyName": "Enchanted Blossom Princess Doll",
    "sellerName": "Dollhouse Dreams",
    "sellerEmail": "hello@dollhousedreams.com",
    "price": 35.75,
    "rating": 4.9,
    "availableQuantity": 40,
    "description": "The Enchanted Blossom Princess Doll is a magnificent figure designed to be the centerpiece of any royal court or imaginative adventure. Standing 11 inches tall, the doll features stunning, high-quality rooted hair that can be styled in countless ways, encouraging creative self-expression. Her gown is the star of the show: a multi-layered dress crafted from shimmering organza and fine tulle, adorned with delicate flower embellishments that catch the light beautifully. The doll’s articulation allows her to sit, stand, and pose gracefully, enhancing narrative play. Beyond her beauty, the Blossom Princess encourages children to develop essential **social and emotional skills** through role-playing scenarios, fostering empathy, communication, and storytelling abilities. This doll is made from safe, durable materials intended to withstand hours of vigorous play. It comes with a small, complementary accessory, such as a magic wand or tiara, completing her regal look. The impeccable craftsmanship and attention to detail, from her painted facial features to her tiny shoes, make her a premium addition to any collection. She is the perfect gift for inspiring young minds to dream big and embark on magical journeys. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/NdrjrVTc/5.jpg",
    "subCategory": "Dolls"
  },
  {
    "toyId": 6,
    "toyName": "Jurassic World T-Rex Model",
    "sellerName": "Prehistoric Toys",
    "sellerEmail": "contact@prehistorict.com",
    "price": 14.99,
    "rating": 4.3,
    "availableQuantity": 68,
    "description": "Unleash the king of the dinosaurs with the Jurassic World T-Rex Model, a large, highly realistic figurine designed for thrilling playtime. This model captures the fearsome power of the Tyrannosaurus Rex with incredibly detailed skin texture, realistic coloring, and a massive, articulated jaw that truly brings the creature to life. Crafted from durable, non-toxic, and flexible plastic, this toy is built to withstand rough play, both indoors and out. Its size makes it perfect for small hands to grip, allowing children to stage epic prehistoric battles and adventures. Beyond play, this figurine serves as an excellent educational tool, sparking curiosity about paleontology, natural history, and extinction events. Each model is hand-painted to ensure a unique and authentic finish. It encourages children to engage in **imaginative storytelling** and provides a tangible way for them to interact with the science of dinosaurs. Whether it's for display on a shelf or for deep-jungle expeditions in the backyard, this T-Rex model delivers excitement and educational value, making it a favorite among young dinosaur enthusiasts and budding scientists alike. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/j9cLqWSk/6.jpg",
    "subCategory": "Figurines"
  },
  {
    "toyId": 7,
    "toyName": "Junior Science Lab Exploration Kit",
    "sellerName": "EduPlay Inc.",
    "sellerEmail": "orders@eduplay.org",
    "price": 55.0,
    "rating": 4.7,
    "availableQuantity": 22,
    "description": "The Junior Science Lab Exploration Kit is an all-inclusive set designed to turn any room into a fascinating science laboratory for children aged 8 and up. This kit contains all the necessary equipment and safe chemicals to conduct over 50 engaging experiments across various disciplines, including chemistry, physics, and biology. Each experiment is clearly explained in the accompanying 40-page instruction manual, which uses full-color illustrations and easy-to-understand language. Children will learn about **chemical reactions, surface tension, magnetic forces**, and even how to grow their own crystals. The kit promotes a hands-on learning approach, encouraging children to hypothesize, test, and observe, thereby building essential **scientific methodology** skills. All components are non-toxic and have been rigorously tested for safety, providing parents with peace of mind. This toy is perfect for stimulating intellectual curiosity, encouraging critical thinking, and making STEM concepts accessible and fun. It's a highly educational gift that offers more than just a momentary distraction; it inspires a lifelong passion for science and discovery. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/wZWNTnV7/7.jpg",
    "subCategory": "Educational"
  },
  {
    "toyId": 8,
    "toyName": "City Rescue Fire Truck Building Set",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 89.99,
    "rating": 4.6,
    "availableQuantity": 18,
    "description": "Construct the ultimate emergency vehicle with the City Rescue Fire Truck Building Set, a detailed and rewarding 750-piece model designed for skilled builders aged 9 and over. This building set culminates in a fully operational fire truck replica, complete with a realistic, multi-section extending ladder that pivots 360 degrees and a functional hose reel. The truck features detailed cab interior, opening storage compartments, and miniature stabilizing jacks. The building process itself is an excellent exercise in **following complex instructions, spatial visualization**, and patience. Once complete, the model provides a platform for extensive imaginative play as children recreate rescue scenarios and civic duty roles. The pieces are fully compatible with other major block brands, allowing for limitless customization and expansion. The high-quality pieces ensure a snug fit and a durable final product. This set is a fantastic gift for any child fascinated by emergency services and engineering, combining the challenge of construction with the excitement of action-packed play. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/q3rc7H6X/8.webp",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 9,
    "toyName": "Sparkle Song Singing Plush Unicorn",
    "sellerName": "Happy Times Gifts",
    "sellerEmail": "support@happygifts.com",
    "price": 22.49,
    "rating": 4.9,
    "availableQuantity": 110,
    "description": "Meet Sparkle Song, the delightful Singing Plush Unicorn, a magical and incredibly soft companion perfect for snuggling and imaginative play. This unicorn is crafted from premium, velvety-soft material and features a shimmering silver horn, rainbow mane, and delicate glittery wings. When you press its hoof, Sparkle Song plays a catchy, cheerful children's song, encouraging kids to sing along and dance. This interactive feature makes it an instant favorite, promoting **auditory recognition and rhythmic movement**. Standing approximately 10 inches tall, it's the perfect size for little arms to hug and carry everywhere. The facial features are embroidered, ensuring there are no small, detachable parts, making it safe for younger children. It runs on easily replaceable AA batteries (not included). The combination of its enchanting appearance and musical element makes it more than just a plush toy; it's a sensory experience that brings joy and comfort. It makes an ideal gift for birthdays, holidays, or just as a special surprise for any child who believes in magic. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/wh6qHhsY/9.webp",
    "subCategory": "Plush Toys"
  },
  {
    "toyId": 10,
    "toyName": "Extreme 4x4 Off-Road RC Crawler",
    "sellerName": "Tech Toy Shop",
    "sellerEmail": "sales@techtoys.com",
    "price": 75.0,
    "rating": 4.4,
    "availableQuantity": 45,
    "description": "Conquer any terrain with the Extreme 4x4 Off-Road RC Crawler, engineered for serious outdoor remote control enthusiasts. This powerful vehicle boasts full-time 4x4 drive, oversized, deep-tread tires, and independent spring suspension on all four wheels, allowing it to navigate rough obstacles like rocks, dirt mounds, and steep inclines with ease. The high-torque motor provides incredible climbing ability, while the durable, impact-resistant chassis protects internal components from tumbles and drops. The ergonomic, pistol-grip controller operates on a reliable 2.4 GHz frequency, ensuring precise control and a long range without interference. With a top speed ideal for crawling and technical maneuvering, it offers a distinct challenge and reward for the driver. The included rechargeable battery delivers about 20 minutes of intense action. This RC crawler promotes **outdoor activity, coordination, and patience**, as mastering the art of off-roading takes practice. It’s built to last and provides a realistic, thrilling off-road experience that standard RC cars simply cannot match. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/JjsGztY4/10.jpg",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 11,
    "toyName": "Marvel Avengers Hero Figure 5-Pack",
    "sellerName": "Collector's Den",
    "sellerEmail": "support@collectorsden.net",
    "price": 60.99,
    "rating": 4.8,
    "availableQuantity": 28,
    "description": "Assemble the greatest heroes on Earth with this essential Marvel Avengers Hero Figure 5-Pack. This set includes five iconic characters—Captain America, Iron Man, Thor, Black Widow, and The Hulk—each standing approximately 4 inches tall. These figures feature multiple points of articulation, allowing kids to recreate epic battles and dynamic poses from the blockbuster films. The high-quality paint application and authentic detailing make these figures visually striking and true to their comic book origins. This pack is perfect for jump-starting a new collection or instantly expanding an existing one. Playing with these figures encourages **imaginative role-playing and collaborative storytelling**, enabling children to explore themes of teamwork, heroism, and justice. Made from safe, durable materials, these figures are designed to withstand active play. The set comes in a beautifully designed window box, making it an impressive gift presentation. It's an indispensable set for any young Avenger fan looking to bring the cinematic universe to their playroom. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/7tQN034w/11.jpg",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 12,
    "toyName": "Beginner Wooden Alphabet Puzzle",
    "sellerName": "Little Learners Toys",
    "sellerEmail": "info@littlelearners.co",
    "price": 12.95,
    "rating": 4.7,
    "availableQuantity": 105,
    "description": "The Beginner Wooden Alphabet Puzzle is a fundamental educational tool designed to introduce toddlers and preschoolers to the letters of the alphabet in a fun, tactile way. This bright, engaging puzzle features 26 chunky wooden pieces, one for each letter, designed to be easily grasped by small hands. Each letter piece is painted in a vibrant, non-toxic color and fits perfectly into its corresponding slot on the wooden board. The act of matching the shape of the letter to the correct space significantly develops **letter recognition, fine motor skills, and hand-eye coordination**. It also encourages early literacy as parents and children can practice saying the letter sounds while they play. The smooth, durable wooden construction ensures the puzzle will last through years of use in both home and classroom environments. Its simple design promotes concentration and problem-solving without overwhelming the child. This is a must-have toy for building a strong foundation for reading and writing, blending educational value seamlessly with enjoyable play. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/nNKb1Qr8/12.jpg",
    "subCategory": "Educational"
  },
  {
    "toyId": 13,
    "toyName": "Fashion Studio Deluxe Doll Set",
    "sellerName": "Dollhouse Dreams",
    "sellerEmail": "hello@dollhousedreams.com",
    "price": 42.0,
    "rating": 4.5,
    "availableQuantity": 33,
    "description": "Step into the world of haute couture with the Fashion Studio Deluxe Doll Set. This comprehensive kit includes an articulated doll ready for her fashion makeover, three complete, stylish outfits, and a variety of accessories like shoes, handbags, and a miniature sewing machine accessory to complete the studio scene. The primary focus of this set is encouraging **creativity and fashion design**, allowing children to mix and match accessories to create countless looks. The high-quality fabrics and realistic details of the garments enhance the immersive play experience. Changing outfits helps develop **fine motor dexterity**, and the storytelling aspect of running a fashion studio boosts communication and imaginative skills. The doll features high-quality, brushable hair for styling, further extending play possibilities. This set provides a rich environment for role-playing, letting children explore careers in fashion design, modeling, and styling. It’s an ideal gift for children who love clothes, creativity, and imaginative play centered on aspirational careers. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/jZTsSptR/13.jpg",
    "subCategory": "Dolls"
  },
  {
    "toyId": 14,
    "toyName": "Modern Combat Tank Model",
    "sellerName": "Prehistoric Toys",
    "sellerEmail": "contact@prehistorict.com",
    "price": 19.5,
    "rating": 4.2,
    "availableQuantity": 55,
    "description": "The Modern Combat Tank Model is a highly detailed, 1:32 scale replica that appeals to young military enthusiasts and model collectors. Constructed from rugged, durable plastic, this toy tank features realistic coloring and markings. The main turret can rotate a full 360 degrees, and the cannon can be adjusted vertically, allowing for realistic scene recreation. The tracks are free-moving, letting the tank roll smoothly over various surfaces. This model is great for action-packed play, promoting **imaginative battle scenarios** and teaching children about military history and engineering concepts in a fun, engaging way. Its strong construction ensures it can endure the rigors of any pretend battlefield. The level of detail is impressive, making it suitable for display as a collectible piece once playtime is over. It’s a compelling toy that combines robust design with educational elements, encouraging strategic thinking and historical curiosity among children aged 6 and up. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/tNJjwr1/14.jpg",
    "subCategory": "Figurines"
  },
  {
    "toyId": 15,
    "toyName": "Ultimate Slime Creation Kit Deluxe",
    "sellerName": "EduPlay Inc.",
    "sellerEmail": "orders@eduplay.org",
    "price": 29.99,
    "rating": 4.1,
    "availableQuantity": 88,
    "description": "Unleash sensory fun with the Ultimate Slime Creation Kit Deluxe, a massive set containing everything needed to make over 15 unique batches of slime. This kit includes multiple clear glues, various activators, vibrant colorants, glitters, foam beads, and glow-in-the-dark powder. Children can experiment with different ingredients to create crunchy, fluffy, galaxy, and color-changing slimes. The comprehensive, step-by-step instruction guide makes the chemistry easy and safe for kids aged 7 and above. Making slime is not just entertaining; it’s a wonderful sensory activity that promotes **calmness, focus, and creativity**. It also serves as a fun introduction to **basic chemical concepts** like polymerization and solution mixing. All materials are non-toxic, washable, and rigorously safety-tested. The entire set comes neatly organized in a durable container for easy storage. This kit is a fantastic hands-on STEM activity that encourages experimentation and provides hours of tactile enjoyment, making it a highly popular and educational gift choice. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/bYsPGBx/15.jpg",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 16,
    "toyName": "Technic Grand Prix Race Car Model",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 155.0,
    "rating": 4.8,
    "availableQuantity": 12,
    "description": "The Technic Grand Prix Race Car Model is the ultimate challenge for experienced builders and motorsport enthusiasts aged 14 and up. This large-scale, detailed building kit features over 1,800 pieces that assemble into a stunning replica of a Formula 1 race car. The model is engineered with realistic functions, including working steering, a complex V6 engine with moving pistons visible through a transparent hood, and independent suspension on all wheels. Building this intricate model enhances **engineering comprehension, mechanical aptitude, and problem-solving skills** at an advanced level. The final result is a display-worthy masterpiece that demonstrates principles of aerodynamics and mechanical design. The included instruction booklet is extensive and requires careful attention to detail, offering a deeply rewarding and focused building experience. This set is fully compatible with all other major block components, but its specific Technic elements provide a unique challenge centered on gears, axles, and technical mechanisms. It's a premium collectible and educational tool combined. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/C5WnT1Pz/16.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 17,
    "toyName": "Cuddly Giant Brown Bear Plush",
    "sellerName": "Happy Times Gifts",
    "sellerEmail": "support@happygifts.com",
    "price": 39.99,
    "rating": 5.0,
    "availableQuantity": 60,
    "description": "The Cuddly Giant Brown Bear Plush is a massive, incredibly soft, and huggable companion, standing at an impressive 3 feet tall. This bear is crafted from premium, high-density polyester fiber, making it soft enough for snuggling and durable enough to withstand years of love. Its classic brown fur, friendly face, and stitched paws make it instantly endearing to children and adults alike. This giant plush provides exceptional **emotional comfort and sensory stimulation**, making it a wonderful addition to a child's bedroom or play area. It serves as a perfect reading companion, a cozy pillow, or the star of imaginative games. All materials are non-allergenic and meet strict safety standards. The size makes it a truly impactful gift for birthdays, Valentine's Day, or baby showers. Its enduring quality and comforting presence ensure it will be a cherished keepsake for a lifetime, becoming the recipient's favorite naptime buddy and friend. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/7xRHcPyP/17.webp",
    "subCategory": "Plush Toys"
  },
  {
    "toyId": 18,
    "toyName": "Explorer Mini RC Submarine",
    "sellerName": "Tech Toy Shop",
    "sellerEmail": "sales@techtoys.com",
    "price": 45.99,
    "rating": 4.3,
    "availableQuantity": 35,
    "description": "Dive into aquatic adventures with the Explorer Mini RC Submarine, a fun and unique remote-controlled toy perfect for use in bathtubs, aquariums, or small pools. This miniature submarine features full directional control (forward, backward, left, right, dive, and surface) via a compact, waterproof remote control. It is equipped with bright LED headlights to illuminate underwater environments, adding a thrilling dimension to play. The submarine is completely sealed and designed with safety in mind, making it durable and reliable in water. It operates on a rechargeable battery (included) that provides up to 10 minutes of underwater exploration per charge. This toy is excellent for encouraging **curiosity about marine life and basic physics concepts** like buoyancy and density. It transforms bath time into an exciting expedition and provides a fascinating change of pace from standard remote control cars. It’s an innovative, high-quality toy that promises unique water-based fun for children aged 8 and up. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/SXHcR9Xd/18.webp",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 19,
    "toyName": "Star Commander Vinyl Pop Figure",
    "sellerName": "Collector's Den",
    "sellerEmail": "support@collectorsden.net",
    "price": 15.0,
    "rating": 4.6,
    "availableQuantity": 120,
    "description": "This Star Commander Vinyl Pop Figure is a must-have collectible for fans of the popular sci-fi series, known for its stylized, oversized head and minimalist design. This is a special limited-edition release featuring the character in a metallic silver suit variation. Standing approximately 3.75 inches tall, the figure is presented in a window display box, preserving its condition for collectors. The vinyl material ensures a durable and high-quality finish, making it perfect for displaying on a desk, shelf, or alongside other pop culture memorabilia. As a collectible, its value is tied to its condition, and this item is guaranteed to be in **mint-in-box condition**. These figures are popular with both casual fans and serious collectors due to their wide variety and unique aesthetic. It makes an affordable and highly desirable gift for celebrating a fandom and expanding a display. Secure this special edition Star Commander to ensure your collection is complete. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/JjtQMyGC/19.jpg",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 20,
    "toyName": "Grand Chef Wooden Play Kitchen Playset",
    "sellerName": "Little Learners Toys",
    "sellerEmail": "info@littlelearners.co",
    "price": 199.0,
    "rating": 4.9,
    "availableQuantity": 8,
    "description": "The Grand Chef Wooden Play Kitchen Playset is a premium, large-scale toy designed to fully immerse children in the joys of culinary role-playing. Standing over 3 feet tall, this sturdy wooden kitchen features realistic elements including clicking oven knobs, a pretend sink with a movable faucet, a stove with burners, and ample storage cabinets. It encourages children to mimic adult behaviors, promoting **social development, communication skills, and nurturing qualities** through interactive play. The durable, non-toxic painted wood construction ensures it is a safe and long-lasting centerpiece for any playroom. While assembly is required, the process is straightforward with detailed instructions. The kitchen provides a fantastic platform for children to play together, practice sharing, and negotiate roles (chef, customer, waiter). Its elegant design and high-quality construction make it a beautiful piece of furniture as well as a toy. This kitchen is an investment in imaginative, open-ended play that supports hours of creative fun. (Approx. 200 words)",
    "pictureURL": "https://i.ibb.co.com/Qv8MY4hz/20.jpg",
    "subCategory": "Role Play"
  }
]
